doc/fazang_user_guide.org
#+TITLE: \texttt{Fazang}: A Reverse-mode Automatic differentiation tool in Fortran
#+SUBTITLE: User's Guide @@latex:\\@@ @@html:<br>@@ (Version pre-release)
#+LATEX_CLASS: amsbook
#+LATEX_CLASS_OPTIONS: [12pt, reqno, oneside]

#+LATEX_HEADER: \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
#+LATEX_HEADER: \usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX_HEADER: \numberwithin{equation}{chapter}

#+LATEX_HEADER: \usepackage{appendix}
#+LATEX_HEADER: \usepackage{url}

#+OPTIONS: toc:nil title:nil
#+AUTHOR: Yi Zhang
#+date: \today
#+email: [[mailto:yz@yizh.org]]

#+MACRO: fz =Fazang=

\begin{titlepage}
\maketitle
Copyright 2022, Yi Zhang
\newline
\newline
\newline

\today
\tableofcontents
\end{titlepage}

* Introduction
  {{{fz}}} is a reverse-mode automatic differentiation (AD) tool. The
  project is heavily influenced by =Stan/Math= cite:Carpenter:2015, a project the author
  is also involved in. {{{fz}}} is intended to support general scientific
  computing in Fortran beyond Bayesian inference and Markov Chain
  Monte Carlo that =Stan/Math= is designed for. 
  
  User should be aware that the project is at early stage and still
  under development. For any questions, suggestions, and
  contributions, please visit the project at https://github.com/yizhang-yiz/fazang.
* Quick Start
  Currently {{{fz}}} has been tested on Linux and MacOS platform, with
  Fortran compiler Intel Fortran 19.0.1+ and GNU Fortran 11.2.0+.

  After downloading {{{fz}}}, user can use =meson= to build the library.
#+begin_src bash
  git clone git@github.com:yizhang-yiz/fazang.git
  cd fazang && mkdir build && cd build
  meson compile
#+end_src
  This generates a shared library at =build/src/=. User needs to link
  this library when building an application. This can be done in
  =meson= by setting
#+begin_src python
  executable('app_name', files('path/to/app_file.F90'), dependencies : fazang_dep)
#+end_src
  
   {{{fz}}} provides a user-facing derived type =var=. This is the
   type for the dependent and independent variables of which the
   adjoint (derivative) will be calculated.

   For example, consider the log of
   the Gaussian distribution density with mean $\mu$ and
   standard deviation $\sigma$
\begin{equation}\label{eq:lnormal_example}
  f(\mu, \sigma) = \log{\left(
      \frac{1}{\sigma\sqrt{2\pi}} \exp\left(
        -\frac{1}{2}\left(\frac{y-\mu}{\sigma}\right)^2
      \right)
    \right)}
\end{equation}
The following programe calculates $\frac{df}{d\mu}$ and
      $\frac{df}{d\sigma}$ at $y=1.3$, $\mu=0.5$, and $\sigma=1.2$.
#+begin_src fortran
  program log_demo
    use fazang ! load Fazang library

    implicit none
  
    real(rk) :: y
    type(var) :: f, sigma, mu

    ! data
    y = 1.3d0

    ! independent variables
    mu = var(0.5d0)
    sigma = var(1.2d0)

    ! dependent
    f = var(-0.5d0 * log(2 * pi))
    f = f - log(sigma)
    f = f - 0.5d0 * ((y - mu) / sigma) ** 2.d0;

    ! use grad() to calculate df/d(mu) and df/d(sigma). Each var's
    ! derivative (also called adjoint) can be access through var%adj().

    call f%grad()
    write(*, *) "df/d(mu): ", mu%adj()
    write(*, *) "df/d(sigma): ", sigma%adj()
  end program log_demo
#+end_src

* Use =Fazang=  
  {{{fz}}} uses =var= type to record numerical and gradient
  operations. The type supports three functions
  - src_fortran[:exports code]{var%val()} : returns value
  - src_fortran[:exports code]{var%adj()} : returns derivative, henceforth referred as /adjoint/.
  - src_fortran[:exports code]{var%grad()} : takes gradient operation with respect to the current src_fortran[:exports code]{var} variable.
** Constructors
=var= can be constructed using overloaded =var= interface.
#+begin_src fortran
        real(real64) :: a, b(3), c(2, 3)
        real(real64) :: new_a, new_b(3), new_c(2, 3)
        type(var) :: x, y(3), z(2, 3)
        ! ...
        x = var()                 ! x%val() == 0.d0
        x = var(a)                ! x%val() == a
        y = var(b)                ! y%val() == b
        z = var(c)                ! z%val() == c
#+end_src
** Assignment
=var= can be assigned from consistent =var= and =real(real64)=.
#+begin_src fortran
  ! ....
  x = new_a                 ! x%val() == new_a
  y = new_b                 ! y%val() == new_b
  z = new_c                 ! z%val() == new_c
#+end_src

** Gradient
   <<sec:gradient>>
Consider a variable $z$ calculated by the composition of a series of operations
\begin{equation*}
z = f_1(z_1), \quad z_1 = f_2(z_2), \quad \dots, \quad z_{n-1} = f_n(z_n).
\end{equation*}
For $z_i, i = 1, \dots, n$ we refer $dz/d{z_i}$ as the /adjoint/ of $z_i$,
denoted by $z_i^{\text{adj}}$.
The chain rule says the adjoints can be calculated recursively cite:griewank_evaluating_2008,
\begin{equation*}
z^{\text{adj}} = 1, \quad
z_1^{\text{adj}} = z^{\text{adj}} \frac{df_1}{dz_1}, \quad
\dots, \quad
z_i^{\text{adj}} = z_{i-1}^{\text{adj}} \frac{df_i}{dz_i}.
\end{equation*}

We often refer each $(f_i, z_i)$ pair as a
/node/, and $z_i$ the /operand/ of operation $f_i$. The above recursion through the nodes requires a way to store
and visit the /callstack/ of nodes.  It is embodied in {{{fz}}} by the =var%grad()=
function. When =z%grad()= is called, =z='s adjoint is set to 1, and
every other =var= variable is transversed with its adjoint updated. In
order to calculate the adjoint with respect to another variable, user
must =call set_zero_all_adj()= first to reset all adjoints to zero.

An alternative to invoke gradient calculation is to define the
dependent as a function and feed it to {{{fz}}}'s =gradient=
function. Take Eq.[[eqref:eq:lnormal_example]] for example, we can first
define the function for $f(\mu, \sigma)$.
#+begin_src fortran
  module func
    use fazang ! load Fazang library
    implicit none

    real(rk), parameter :: y = 1.3d0

  contains
    type(var) function f(x)
      type(var), intent(in) :: x(:)
      type(var) :: mu, sigma
      mu = x(1)
      sigma = x(2)
      f = -0.5d0 * log(2 * pi) - log(sigma) - 0.5d0 * ((y - mu) / sigma) ** 2.d0;
    end function f

  end module func
#+end_src
Then we can supply function =f= as a procedure argument.
#+begin_src fortran
  program log_demo2
    use iso_c_binding
    use fazang
    use func

    implicit none
  
    real(real64) :: fx(3), x(2)
    x = [0.5d0, 1.2d0]

    fx = gradient(f, x)
    write(*, *) "f(x): ", fx(1)
    write(*, *) "df/d(x(1)): ", fx(2)
    write(*, *) "df/d(x(2)): ", fx(3)
  end program log_demo2
#+end_src
The output of =gradient(f, x)= is an array of size =1 + size(x)=, with
first component being the function value, and the rest the partial
derivatives.

Note that the above approach of using =gradient= function does not
involve explicitly setting up =var= variables. {{{fz}}} achieves this
by using a /nested/ AD envionment.

