doc/fazang_user_guide.tex
% Created 2022-02-16 Wed 14:39
% Intended LaTeX compiler: pdflatex
\documentclass[12pt, reqno, oneside]{amsbook}
              \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
\usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
\BeforeBeginEnvironment{minted}{\begin{mdframed}}
\AfterEndEnvironment{minted}{\end{mdframed}}
\numberwithin{equation}{chapter}
\usepackage{appendix}
\usepackage{url}


\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\usepackage{caption}
\author{Yi Zhang}
\date{\today}
\title{\texttt{Fazang}: A Reverse-mode Automatic differentiation tool in Fortran\\\medskip
\large User's Guide \\  (Version 0.1.0)}
\hypersetup{
 pdfauthor={Yi Zhang},
 pdftitle={\texttt{Fazang}: A Reverse-mode Automatic differentiation tool in Fortran},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\begin{titlepage}
\maketitle
Copyright 2022, Yi Zhang
\newline
\newline
\newline

\today
\tableofcontents
\end{titlepage}

\chapter{Introduction}
\label{sec:orgb4421eb}
\texttt{Fazang} is a reverse-mode automatic differentiation (AD) tool. The
project is heavily influenced by \texttt{Stan/Math} \cite{Carpenter:2015}, a project the author
is also involved in. \texttt{Fazang} is intended to support general scientific
computing in Fortran beyond Bayesian inference and Markov Chain
Monte Carlo that \texttt{Stan/Math} is designed for. 

User should be aware that the project is at early stage and still
under development. For any questions, suggestions, and
contributions, please visit the project at \url{https://github.com/yizhang-yiz/fazang}.
\chapter{Quick Start}
\label{sec:orgcc6cf98}
Currently \texttt{Fazang} has been tested on Linux and MacOS platform, with
Fortran compiler Intel Fortran 19.0.1+ and GNU Fortran 11.2.0+.

After downloading \texttt{Fazang}, user can use \texttt{meson} to build the library.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{bash}
git clone git@github.com:yizhang-yiz/fazang.git
cd fazang && mkdir build && cd build
meson compile
\end{minted}
This generates a shared library at \texttt{build/src/}. User needs to link
this library when building an application. This can be done in
\texttt{meson} by setting
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{python}
executable('app_name', files('path/to/app_file.F90'), dependencies : fazang_dep)
\end{minted}

\texttt{Fazang} provides a user-facing derived type \texttt{var}. This is the
type for the dependent and independent variables of which the
adjoint (derivative) will be calculated.

For example, consider the log of
the Gaussian distribution density with mean \(\mu\) and
standard deviation \(\sigma\)
\begin{equation}\label{eq:lnormal_example}
  f(\mu, \sigma) = \log{\left(
      \frac{1}{\sigma\sqrt{2\pi}} \exp\left(
        -\frac{1}{2}\left(\frac{y-\mu}{\sigma}\right)^2
      \right)
    \right)}
\end{equation}
The following programe calculates \(\frac{df}{d\mu}\) and
      \(\frac{df}{d\sigma}\) at \(y=1.3\), \(\mu=0.5\), and \(\sigma=1.2\).
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
program log_demo
  use fazang ! load Fazang library

  implicit none

  real(rk) :: y
  type(var) :: f, sigma, mu

  ! data
  y = 1.3d0

  ! independent variables
  mu = var(0.5d0)
  sigma = var(1.2d0)

  ! dependent
  f = var(-0.5d0 * log(2 * pi))
  f = f - log(sigma)
  f = f - 0.5d0 * ((y - mu) / sigma) ** 2.d0;

  ! use grad() to calculate df/d(mu) and df/d(sigma). Each var's
  ! derivative (also called adjoint) can be access through var%adj().

  call f%grad()
  write(*, *) "df/d(mu): ", mu%adj()
  write(*, *) "df/d(sigma): ", sigma%adj()
end program log_demo
\end{minted}

\chapter{Use \texttt{Fazang}}
\label{sec:org446bb05}
\texttt{Fazang} uses \texttt{var} type to record numerical and gradient
operations. The type supports three functions
\begin{itemize}
\item \mintinline[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}{var%val()} : returns value
\item \mintinline[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}{var%adj()} : returns derivative, henceforth referred as \emph{adjoint}.
\item \mintinline[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}{var%grad()} : takes gradient operation with respect to the current \mintinline[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}{var} variable.
\end{itemize}
\section{Constructors}
\label{sec:orgbe12852}
\texttt{var} can be constructed using overloaded \texttt{var} interface.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
real(real64) :: a, b(3), c(2, 3)
real(real64) :: new_a, new_b(3), new_c(2, 3)
type(var) :: x, y(3), z(2, 3)
! ...
x = var()                 ! x%val() == 0.d0
x = var(a)                ! x%val() == a
y = var(b)                ! y%val() == b
z = var(c)                ! z%val() == c
\end{minted}
\section{Assignment}
\label{sec:org8058780}
\texttt{var} can be assigned from consistent \texttt{var} and \texttt{real(real64)}.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
! ....
x = new_a                 ! x%val() == new_a
y = new_b                 ! y%val() == new_b
z = new_c                 ! z%val() == new_c
\end{minted}

\section{Gradient}
\label{sec:orgfd6291a}
   \label{sec:gradient}
Consider a variable \(z\) calculated by the composition of a series of operations
\begin{equation*}
z = f_1(z_1), \quad z_1 = f_2(z_2), \quad \dots, \quad z_{n-1} = f_n(z_n).
\end{equation*}
For \(z_i, i = 1, \dots, n\) we refer \(dz/d{z_i}\) as the \emph{adjoint} of \(z_i\),
denoted by \(z_i^{\text{adj}}\).
The chain rule says the adjoints can be calculated recursively \cite{griewank_evaluating_2008},
\begin{equation*}
z^{\text{adj}} = 1, \quad
z_1^{\text{adj}} = z^{\text{adj}} \frac{df_1}{dz_1}, \quad
\dots, \quad
z_i^{\text{adj}} = z_{i-1}^{\text{adj}} \frac{df_i}{dz_i}.
\end{equation*}

We often refer each \((f_i, z_i)\) pair as a
\emph{node}, and \(z_i\) the \emph{operand} of operation \(f_i\). The above recursion through the nodes requires a way to store
and visit the \emph{callstack} of nodes.  It is embodied in \texttt{Fazang} by the \texttt{var\%grad()}
function. When \texttt{z\%grad()} is called, \texttt{z}'s adjoint is set to 1, and
every other \texttt{var} variable is transversed with its adjoint updated. In
order to calculate the adjoint with respect to another variable, user
must \texttt{call set\_zero\_all\_adj()} first to reset all adjoints to zero.

An alternative to invoke gradient calculation is to define the
dependent as a function and feed it to \texttt{Fazang}'s \texttt{gradient}
function. Take Eq.\eqref{eq:lnormal_example} for example, we can first
define the function for \(f(\mu, \sigma)\).
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
module func
  use fazang ! load Fazang library
  implicit none

  real(rk), parameter :: y = 1.3d0

contains
  type(var) function f(x)
    type(var), intent(in) :: x(:)
    type(var) :: mu, sigma
    mu = x(1)
    sigma = x(2)
    f = -0.5d0 * log(2 * pi) - log(sigma) - 0.5d0 * ((y - mu) / sigma) ** 2.d0;
  end function f

end module func
\end{minted}
Then we can supply function \texttt{f} as a procedure argument.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
program log_demo2
  use iso_c_binding
  use fazang
  use func

  implicit none

  real(real64) :: fx(3), x(2)
  x = [0.5d0, 1.2d0]

  fx = gradient(f, x)
  write(*, *) "f(x): ", fx(1)
  write(*, *) "df/d(x(1)): ", fx(2)
  write(*, *) "df/d(x(2)): ", fx(3)
end program log_demo2
\end{minted}
The output of \texttt{gradient(f, x)} is an array of size \texttt{1 + size(x)}, with
first component being the function value, and the rest the partial
derivatives.

Note that the above approach of using \texttt{gradient} function does not
involve explicitly setting up \texttt{var} variables. \texttt{Fazang} achieves this
by using a \emph{nested} AD envionment.
