doc/fazang_user_guide.org
** Nested AD envionment
   <<sec:nested>>
Let us take a look of the internals of {{{fz}}}'s =gradient= function.
The =dependent_function= interface requires $f$ to follow the above
example's signature, and =x= is the =real64= array of independent variables.
We then create the =var= version of =x= and introduct it to =f=. The
evaluation result is saved in =f_var= variable. The adjoints are
obtained by calling =f_var%grad()=. Unlike what we have seen, the
above process happens within a pairing =begin_nested()= and
=end_nested()= calls.
#+begin_src fortran
  function gradient(f, x) result (f_df)
    procedure(dependent_function) :: f
    real(real64), intent(in) :: x(:)
    real(real64) :: f_df(1 + size(x))
    type(var) :: x_var(size(x)), f_var

    call begin_nested()

    x_var = var(x)
    f_var = f(x_var)
    f_df(1) = f_var%val()
    call f_var%grad()
    f_df(2:(1+size(x))) = x_var%adj()

    call end_nested()
  end function gradient
#+end_src
When we use these two functions, all the =var= variables created
in between are "temporary", in the sense that the values and adjoints
of these variables are no longer available after =call
end_nested()=. User can use this function pair to construct a local
gradient evaluation procedure.

** Jacobian
   <<sec:jacobian>>
Similar to =gradient=, using the same nested technique {{{fz}}}
provides a =jacobian= function that calculates the Jacobian matrix of
=f=, a multivariate function $f: \mathbb{R}^m \rightarrow \mathbb{R}^n$ for
an input array =x= of dimension =m=.
#+begin_src fortran
  function jacobian(f, n, x) result (f_df)
#+end_src
The input function must follow the interface
#+begin_src fortran
  abstract interface
     function jac_dependent_function (x, n) result (fx)
       import :: var
       integer, intent(in) :: n
       type(var), intent(in) :: x(:)
       type(var) :: fx(n)
     end function jac_dependent_function
  end interface
#+end_src
where =n= is the output dimension. Like =gradient=, the output =f_df=
has dimension $n\times(m+1)$, with the first column being the function
results and the rest columns the adjoints.

** Functions
Numeric functions supported by {{{fz}}} are listed in Appendix [[appendix:func]]. All unary and
binary functions are =elemental=. The binary functions allow mixed
argument types, namely, either argument can be =real64= type while the
other the =var= type.

Probability distributions supported by {{{fz}}} are list in Appendix [[ref:appendix:likelihood]].

** Ordinary differential equations
{{{fz}}} supports ODE solutions through CVODES from SUNDIALS library
cite:hindmarsh2005sundials. One can solve ODE like this.

#+begin_src fortran
! user defined ODE
module ode_mod
  use fazang
  use, intrinsic :: iso_c_binding
  implicit none

  real(rk), parameter :: params(2) = [0.2d0, 0.1d0]

contains
  ! user defined right-hand-side
  subroutine eval_rhs(t, y, fy)
    real(c_double), intent(in) :: t, y(:)
    real(c_double), intent(inout) :: fy(size(y))
    fy(1) = y(2)
    fy(2) = t * y(1) * sum(params%val())
  end subroutine eval_rhs
end module ode_mod

program cvodes_solve_data
  use ode_mod                   ! import ODE
  use fazang                    ! import Fazang

  implicit none

  real(rk) :: yt(2, 3)          ! output array
  real(rk) :: y0(2)             ! initial condition
  type(cvodes_tol) :: tol       ! basic solver control
  
  ! use BDF method with given relative tolerance, absolute tolerance,
  ! and max number of steps between outputs
  tol = cvodes_tol(CV_BDF, 1.d-10, 1.d-10, 1000_8)

  ! initial condition
  y0 = [1.2d0, 1.8d0]

  ! solve the ODE with initial time 0.d0 and
  ! output time 1.d0, 2.d0, 3.d0
  yt = cvodes_sol(0.d0, y0, [1.d0, 2.d0, 3.d0], eval_rhs, tol)

end program cvodes_solve_data
#+end_src
In the above example, we first define an ODE following {{{fz}}}'s
interface on the RHS. The defined RHS function =eval_rhs= will be later used as an
argument to =cvodes_sol=. In addition to initial condition, one must
also define an object for solver control. Such an object must be of a
type that =extend= the =cvodes_options= abstract type. Here we use {{{fz}}}'s
basic type =cvodes_tol=, which gives: the integration scheme (=CV_BDF=
for BDF method or =CV_ADAMS= for Adams-Moulton method), relative
tolerance, absolution tolerance, and the maximum number of steps
allowed between output.

Then to the solver interface =cvodes_sol= we give the initial time,
initial condition, array for output time, the RHS subroutine, and the
solver control. It returns a 2D array with each column at a requested
output time.

*** Forward sensitivity
Combining the sensitivity capability of =CVODES= and AD from {{{fz}}},
we can solve for ODE sensitivity with respect to given parameters
without explicitly supplying Jacobian. For that the user-defined ODE
must include an additional RHS definition with =var= parameters,
following {{{fz}}}'s RHS interface.
#+begin_src fortran
module ode_mod
  use fazang
  use, intrinsic :: iso_c_binding
  implicit none

  real(rk), parameter :: omega = 0.5d0
  real(rk), parameter :: d1 = 1.0d0
  real(rk), parameter :: d2 = 1.0d0

contains
  ! right-hand-side for data input
  subroutine eval_rhs(t, y, fy)
    implicit none
    real(c_double), intent(in) :: t, y(:)
    real(c_double), intent(inout) :: fy(size(y))
    fy(1) = y(2)
    fy(2) = sin(omega * d1 * d2 * t)
  end subroutine eval_rhs

  ! right-hand-side for var input with parameters
  ! y, p, and output fy must all be of var type
  subroutine eval_rhs_pvar(t, y, fy, p)
    implicit none
    real(c_double), intent(in) :: t
    type(var), intent(in) :: y(:), p(:)
    type(var), intent(inout) :: fy(size(y))
    fy(1) = y(2)
    fy(2) = sin(p(1) * p(2) * p(3) * t)
  end subroutine eval_rhs_pvar
end module ode_mod
#+end_src
Now we can solve the defined ODE in a similar way.
#+begin_src fortran
program cvodes_demo
  use ode_mod
  use fazang
  implicit none

  type(var) :: yt(2, 3)
  type(cvodes_tol) :: tol
  real(rk), parameter :: ts(3) = [1.2d0, 2.4d0, 4.8d0]
  real(rk), parameter :: y00(2) = [0.2d0, 0.8d0]
  type(var) :: param(3)
  real(rk) :: y0(2), ga(2)
  integer :: i, j

  y0 = y00                      ! init condition
  param = var([omega, d1, d2])  ! parameters
  tol = cvodes_tol(CV_BDF, 1.d-10, 1.d-10, 1000_8)

  yt = cvodes_sol(0.d0, y0, ts, param, eval_rhs,&
       & eval_rhs_pvar, tol)
! ...
end program cvodes_demo
#+end_src
Note that now the call to =cvodes_sol= includes additional argument
=param= as the sensitivity parameters, as well as the RHS function for
=var= inputs. When the sensitivities are desired, one can take the
gradient of the result in the same way.
#+begin_src fortran
  call yt(1, 1) % grad()
  write(*, *) "dy_1/ d_omega at time ts(1):", param(1)%adj()
#+end_src

*** Functions
