doc/fazang_user_guide.tex

\section{Nested AD envionment}
\label{sec:orgf79e864}
   \label{sec:nested}
Let us take a look of the internals of \texttt{Fazang}'s \texttt{gradient} function.
The \texttt{dependent\_function} interface requires \(f\) to follow the above
example's signature, and \texttt{x} is the \texttt{real64} array of independent variables.
We then create the \texttt{var} version of \texttt{x} and introduct it to \texttt{f}. The
evaluation result is saved in \texttt{f\_var} variable. The adjoints are
obtained by calling \texttt{f\_var\%grad()}. Unlike what we have seen, the
above process happens within a pairing \texttt{begin\_nested()} and
\texttt{end\_nested()} calls.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
function gradient(f, x) result (f_df)
  procedure(dependent_function) :: f
  real(real64), intent(in) :: x(:)
  real(real64) :: f_df(1 + size(x))
  type(var) :: x_var(size(x)), f_var

  call begin_nested()

  x_var = var(x)
  f_var = f(x_var)
  f_df(1) = f_var%val()
  call f_var%grad()
  f_df(2:(1+size(x))) = x_var%adj()

  call end_nested()
end function gradient
\end{minted}
When we use these two functions, all the \texttt{var} variables created
in between are "temporary", in the sense that the values and adjoints
of these variables are no longer available after \texttt{call
end\_nested()}. User can use this function pair to construct a local
gradient evaluation procedure.

\section{Jacobian}
\label{sec:orgdde6fc2}
   \label{sec:jacobian}
Similar to \texttt{gradient}, using the same nested technique \texttt{Fazang}
provides a \texttt{jacobian} function that calculates the Jacobian matrix of
\texttt{f}, a multivariate function \(f: \mathbb{R}^m \rightarrow \mathbb{R}^n\) for
an input array \texttt{x} of dimension \texttt{m}.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
function jacobian(f, n, x) result (f_df)
\end{minted}
The input function must follow the interface
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
abstract interface
   function jac_dependent_function (x, n) result (fx)
     import :: var
     integer, intent(in) :: n
     type(var), intent(in) :: x(:)
     type(var) :: fx(n)
   end function jac_dependent_function
end interface
\end{minted}
where \texttt{n} is the output dimension. Like \texttt{gradient}, the output \texttt{f\_df}
has dimension \(n\times(m+1)\), with the first column being the function
results and the rest columns the adjoints.

\section{Functions}
\label{sec:org2b87706}
Numeric functions supported by \texttt{Fazang} are listed in Appendix \ref{appendix:func}. All unary and
binary functions are \texttt{elemental}. The binary functions allow mixed
argument types, namely, either argument can be \texttt{real64} type while the
other the \texttt{var} type.

Probability distributions supported by \texttt{Fazang} are list in Appendix \ref{appendix:likelihood}.

\section{Ordinary differential equations}
\label{sec:orge24bbe8}
\texttt{Fazang} supports ODE solutions through CVODES from SUNDIALS library
\cite{hindmarsh2005sundials}. One can solve ODE like this.

\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
! user defined ODE
module ode_mod
  use fazang
  use, intrinsic :: iso_c_binding
  implicit none

  real(rk), parameter :: params(2) = [0.2d0, 0.1d0]

contains
  ! user defined right-hand-side
  subroutine eval_rhs(t, y, fy)
    real(c_double), intent(in) :: t, y(:)
    real(c_double), intent(inout) :: fy(size(y))
    fy(1) = y(2)
    fy(2) = t * y(1) * sum(params%val())
  end subroutine eval_rhs
end module ode_mod

program cvodes_solve_data
  use ode_mod                   ! import ODE
  use fazang                    ! import Fazang

  implicit none

  real(rk) :: yt(2, 3)          ! output array
  real(rk) :: y0(2)             ! initial condition
  type(cvodes_tol) :: tol       ! basic solver control

  ! use BDF method with given relative tolerance, absolute tolerance,
  ! and max number of steps between outputs
  tol = cvodes_tol(CV_BDF, 1.d-10, 1.d-10, 1000_8)

  ! initial condition
  y0 = [1.2d0, 1.8d0]

  ! solve the ODE with initial time 0.d0 and
  ! output time 1.d0, 2.d0, 3.d0
  yt = cvodes_sol(0.d0, y0, [1.d0, 2.d0, 3.d0], eval_rhs, tol)

end program cvodes_solve_data
\end{minted}
In the above example, we first define an ODE following \texttt{Fazang}'s
interface on the RHS. The defined RHS function \texttt{eval\_rhs} will be later used as an
argument to \texttt{cvodes\_sol}. In addition to initial condition, one must
also define an object for solver control. Such an object must be of a
type that \texttt{extend} the \texttt{cvodes\_options} abstract type. Here we use \texttt{Fazang}'s
basic type \texttt{cvodes\_tol}, which gives: the integration scheme (\texttt{CV\_BDF}
for BDF method or \texttt{CV\_ADAMS} for Adams-Moulton method), relative
tolerance, absolution tolerance, and the maximum number of steps
allowed between output.

Then to the solver interface \texttt{cvodes\_sol} we give the initial time,
initial condition, array for output time, the RHS subroutine, and the
solver control. It returns a 2D array with each column at a requested
output time.

\subsection{Forward sensitivity}
\label{sec:org5755bfa}
Combining the sensitivity capability of \texttt{CVODES} and AD from \texttt{Fazang},
we can solve for ODE sensitivity with respect to given parameters
without explicitly supplying Jacobian. For that the user-defined ODE
must include an additional RHS definition with \texttt{var} parameters,
following \texttt{Fazang}'s RHS interface.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
module ode_mod
  use fazang
  use, intrinsic :: iso_c_binding
  implicit none

  real(rk), parameter :: omega = 0.5d0
  real(rk), parameter :: d1 = 1.0d0
  real(rk), parameter :: d2 = 1.0d0

contains
  ! right-hand-side for data input
  subroutine eval_rhs(t, y, fy)
    implicit none
    real(c_double), intent(in) :: t, y(:)
    real(c_double), intent(inout) :: fy(size(y))
    fy(1) = y(2)
    fy(2) = sin(omega * d1 * d2 * t)
  end subroutine eval_rhs

  ! right-hand-side for var input with parameters
  ! y, p, and output fy must all be of var type
  subroutine eval_rhs_pvar(t, y, fy, p)
    implicit none
    real(c_double), intent(in) :: t
    type(var), intent(in) :: y(:), p(:)
    type(var), intent(inout) :: fy(size(y))
    fy(1) = y(2)
    fy(2) = sin(p(1) * p(2) * p(3) * t)
  end subroutine eval_rhs_pvar
end module ode_mod
\end{minted}
Now we can solve the defined ODE in a similar way.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
program cvodes_demo
  use ode_mod
  use fazang
  implicit none

  type(var) :: yt(2, 3)
  type(cvodes_tol) :: tol
  real(rk), parameter :: ts(3) = [1.2d0, 2.4d0, 4.8d0]
  real(rk), parameter :: y00(2) = [0.2d0, 0.8d0]
  type(var) :: param(3)
  real(rk) :: y0(2), ga(2)
  integer :: i, j

  y0 = y00                      ! init condition
  param = var([omega, d1, d2])  ! parameters
  tol = cvodes_tol(CV_BDF, 1.d-10, 1.d-10, 1000_8)

  yt = cvodes_sol(0.d0, y0, ts, param, eval_rhs,&
       & eval_rhs_pvar, tol)
! ...
end program cvodes_demo
\end{minted}
Note that now the call to \texttt{cvodes\_sol} includes additional argument
\texttt{param} as the sensitivity parameters, as well as the RHS function for
\texttt{var} inputs. The sensitivities are obtained the same way by calling
\texttt{grad} and \texttt{adj} functions.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
call yt(1, 1) % grad()
write(*, *) "dy_1/ d_omega at time ts(1):", param(1)%adj()
\end{minted}
