doc/fazang_user_guide.org
**** Data solution     
#+begin_src fortran
function cvodes_sol(t, y, ts, rhs, cvs_options) result(yt)
    real(real64), intent(in) :: t          ! initial time
    real(real64), intent(inout) :: y(:)    ! initial condition
    real(real64), intent(in) :: ts(:)      ! output time
    procedure(cvs_rhs_func) :: rhs         ! RHS definition (see below)
    class(cvodes_options), intent(in) :: cvs_options ! solver control
    real(real64) :: yt(size(y), size(ts))  ! solution
#+end_src

**** Sensitivity solution  with respect to the initial condition
#+begin_src fortran
function cvodes_sol(t, y, ts, rhs, rhs_yvar, cvs_options) result(yt)
    real(real64), intent(in) :: t          ! initial time
    type(var), intent(inout) :: y(:)       ! initial condition
    real(real64), intent(in) :: ts(:)      ! output time
    procedure(cvs_rhs_func) :: rhs         ! data-only RHS (see below)
    procedure(cvs_rhs_func_yvar) :: rhs_yvar ! var-type RHS (see below)
    class(cvodes_options), intent(in) :: cvs_options  ! solver control
    type(var) :: yt(size(y), size(ts))     ! solution
#+end_src

**** Sensitivity solution  with respect to the parameters
#+begin_src fortran
function cvodes_sol(t, y, ts, param, rhs, rhs_pvar, cvs_options) result(yt)
    real(real64), intent(in) :: t          ! initial time
    real(real64), intent(inout) :: y(:)    ! initial condition
    real(real64), intent(in) :: ts(:)      ! output time
    type(var), target, intent(in) :: param(:) ! parameters
    procedure(cvs_rhs_func) :: rhs         ! data-only RHS (see below)
    procedure(cvs_rhs_func_pvar) :: rhs_pvar ! var-type RHS (see below)
    class(cvodes_options), intent(in) :: cvs_options  ! solver control
    type(var) :: yt(size(y), size(ts))     ! solution
#+end_src

**** Interfaces for different solvers
#+begin_src fortran
  abstract interface
     subroutine cvs_rhs_func(t, y, fy)
       import c_double
       real(c_double), intent(in) :: t, y(:)
       real(c_double), intent(inout) :: fy(size(y))
     end subroutine cvs_rhs_func

     subroutine cvs_rhs_func_yvar(t, y, f)
       import c_double, var
       real(c_double), intent(in) :: t
       type(var), intent(in) :: y(:)
       type(var), intent(inout) :: f(size(y))
     end subroutine cvs_rhs_func_yvar

     subroutine cvs_rhs_func_pvar(t, y, f, p)
       import c_double, var
       real(c_double), intent(in) :: t
       type(var), intent(in) :: y(:), p(:)
       type(var), intent(inout) :: f(size(y))
     end subroutine cvs_rhs_func_pvar
  end interface
#+end_src

**** Solver controls
The last argument of the solver call is a solver control
object. User-defined type must be able to follow =CVODES= user guide
to modify =CVODES= memory object, by extending the abstract type =cvodes_options=.
#+begin_src fortran
  type, abstract :: cvodes_options
     integer :: cv_method = -1
   contains
     procedure(set_cvodes), deferred :: set
  end type cvodes_options

  abstract interface
     subroutine set_cvodes(this, mem)
       import c_ptr, cvodes_options
       class(cvodes_options), intent(in) :: this
       type(c_ptr), intent(inout) :: mem ! CVODES memory
     end subroutine set_cvodes
  end interface
#+end_src
One can follow {{{fz}}} 's tolerance control type as an example.
#+begin_src fortran
  type, extends(cvodes_options) :: cvodes_tol
     real(c_double) :: rtol, atol
     integer(c_long) :: max_nstep
  contains
    procedure :: set
 end type cvodes_tol

contains

  subroutine set(this, mem)
    class(cvodes_tol), intent(in) :: this
    type(c_ptr), intent(inout) :: mem ! CVODES memory
    integer :: ierr
! call cvodes functions
    ierr = FCVodeSStolerances(mem, this % rtol, this % atol)
    ierr = FCVodeSetMaxNumSteps(mem, this % max_nstep)
  end subroutine set
#+end_src

* Design
The core of any reverse-mode automatic differentiation is the data
structure to store and visit the callstack. {{{fz}}} achieves this
through two derived types, =tape= and =vari=.

** =tape= data structure
  A =tape= is an =int32= array emulating a stack, with an integer marker =head= pointing to the
  head to the current stack top.
#+begin_src fortran
  type :: tape
       integer(ik) :: head = 1
       integer(ik), allocatable :: storage(:)
  !...
#+end_src
  Each time a new AD node is created,
  space in =storage= is allotted to store the node's
  - value $f_i(z_i)$,
  - adjoint $z_{i-1}^{\text{adj}}$,
  - number of =var= operands of $f_i$,
  - The =var= operands' index in the same =tape= array,
  - number of =real64= operands of $f_i$,
  - The =real64= operands' value.
  
  Since a node's value, adjoint, and data
  operands are =real64=, they are first converted to =int32= using
  =transfer= function before stored in the =tape= array, so that each such
  a value occupies two =storage= entries. After each
  allotation, the =head= is moved to point to the next empty slot in
  the array after saving its current value to a =vari= type variable
  for future retrieval.

** =vari= type
   The =vari= type is simply a proxy of a node's storage location in the tape
   #+begin_src fortran
     type :: vari
       integer(ik) :: i = 0
       procedure(chain_op), pass, pointer :: chain
     contains
        !....
#+end_src   
where =i= is the index to the beginning of a node's storage, and the
=chain= procedure encodes the node's operation
$f_i$. =chain= follows an interface that describes the chain rule
operation
#+begin_src fortran
  abstract interface
     subroutine chain_op(this)
       import :: vari
       class(vari), intent(in) :: this
     end subroutine chain_op
  end interface
#+end_src  
An alternative to integer index is to a =pointer= to the according
enry in the =tape= array. However, we will need to expand the
=storage= when it is filled up, and {{{fz}}} does this by doubling the
=storage= size and use =move_alloc= to
restore the original values. Since there is no guarantee that =move_alloc=
will keep the original memory, a pointer to the original address would
be corrupted.

As a {{{fz}}} program steps forward, a series of =vari= variables are
generated, with their /values/ calculated and stored. This is called
a /forward pass/. The generated =vari= variables in the forward pass are
stored in array =varis=. Each entry in =varis= is a dependent
(operation output) of one or more previous entries.

** =var= type
The user-facing =var= type serves as proxy to =vari=. Each =var=
stores the index of a =vari= in the =varis= array.
#+begin_src fortran
    type :: var
       integer(int32) :: vi
     contains
       procedure :: val
       procedure :: adj
       procedure :: grad
       procedure :: set_chain
    end type var
#+end_src
After the forward pass, when adjoints are desired, we call =grad= or
=gradient= procedure. This initiates a /backward pass/, in which  the
=varis= array is traversed backward
so that each =vari='s =chain= procedure is called to update the
operand adjoints.
#+begin_src fortran
    subroutine grad(this)
      class(var), intent(in) :: this
      integer i
      call callstack % varis (this%vi) % init_dependent()
      do i = callstack % head - 1, 1, -1
         call callstack % varis(i) % chain()
      end do
    end subroutine grad
#+end_src
Here =callstack= is the module variable that encapsulate =tape= and
=varis= arrays.

