doc/fazang_user_guide.tex

\subsection{Functions}
\label{sec:orgf1d1100}
\begin{enumerate}
\item Data solution
\label{sec:org271df10}
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
function cvodes_sol(t, y, ts, rhs, cvs_options) result(yt)
    real(real64), intent(in) :: t          ! initial time
    real(real64), intent(inout) :: y(:)    ! initial condition
    real(real64), intent(in) :: ts(:)      ! output time
    procedure(cvs_rhs_func) :: rhs         ! RHS definition (see below)
    class(cvodes_options), intent(in) :: cvs_options ! solver control
    real(real64) :: yt(size(y), size(ts))  ! solution
\end{minted}

\item Sensitivity solution  with respect to the initial condition
\label{sec:orgf19dcad}
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
function cvodes_sol(t, y, ts, rhs, rhs_yvar, cvs_options) result(yt)
    real(real64), intent(in) :: t          ! initial time
    type(var), intent(inout) :: y(:)       ! initial condition
    real(real64), intent(in) :: ts(:)      ! output time
    procedure(cvs_rhs_func) :: rhs         ! data-only RHS (see below)
    procedure(cvs_rhs_func_yvar) :: rhs_yvar ! var-type RHS (see below)
    class(cvodes_options), intent(in) :: cvs_options  ! solver control
    type(var) :: yt(size(y), size(ts))     ! solution
\end{minted}

\item Sensitivity solution  with respect to the parameters
\label{sec:org64f810b}
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
function cvodes_sol(t, y, ts, param, rhs, rhs_pvar, cvs_options) result(yt)
    real(real64), intent(in) :: t          ! initial time
    real(real64), intent(inout) :: y(:)    ! initial condition
    real(real64), intent(in) :: ts(:)      ! output time
    type(var), target, intent(in) :: param(:) ! parameters
    procedure(cvs_rhs_func) :: rhs         ! data-only RHS (see below)
    procedure(cvs_rhs_func_pvar) :: rhs_pvar ! var-type RHS (see below)
    class(cvodes_options), intent(in) :: cvs_options  ! solver control
    type(var) :: yt(size(y), size(ts))     ! solution
\end{minted}

\item Interfaces for different solvers
\label{sec:org58311fb}
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
abstract interface
   subroutine cvs_rhs_func(t, y, fy)
     import c_double
     real(c_double), intent(in) :: t, y(:)
     real(c_double), intent(inout) :: fy(size(y))
   end subroutine cvs_rhs_func

   subroutine cvs_rhs_func_yvar(t, y, f)
     import c_double, var
     real(c_double), intent(in) :: t
     type(var), intent(in) :: y(:)
     type(var), intent(inout) :: f(size(y))
   end subroutine cvs_rhs_func_yvar

   subroutine cvs_rhs_func_pvar(t, y, f, p)
     import c_double, var
     real(c_double), intent(in) :: t
     type(var), intent(in) :: y(:), p(:)
     type(var), intent(inout) :: f(size(y))
   end subroutine cvs_rhs_func_pvar
end interface
\end{minted}

\item Solver controls
\label{sec:org06a915d}
The last argument of the solver call is a solver control
object. User-defined type must be able to follow \texttt{CVODES} user guide
to modify \texttt{CVODES} memory object, by extending the abstract type \texttt{cvodes\_options}.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
type, abstract :: cvodes_options
   integer :: cv_method = -1
 contains
   procedure(set_cvodes), deferred :: set
end type cvodes_options

abstract interface
   subroutine set_cvodes(this, mem)
     import c_ptr, cvodes_options
     class(cvodes_options), intent(in) :: this
     type(c_ptr), intent(inout) :: mem ! CVODES memory
   end subroutine set_cvodes
end interface
\end{minted}
One can follow \texttt{Fazang} 's tolerance control type as an example.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
  type, extends(cvodes_options) :: cvodes_tol
     real(c_double) :: rtol, atol
     integer(c_long) :: max_nstep
  contains
    procedure :: set
 end type cvodes_tol

contains

  subroutine set(this, mem)
    class(cvodes_tol), intent(in) :: this
    type(c_ptr), intent(inout) :: mem ! CVODES memory
    integer :: ierr
! call cvodes functions
    ierr = FCVodeSStolerances(mem, this % rtol, this % atol)
    ierr = FCVodeSetMaxNumSteps(mem, this % max_nstep)
  end subroutine set
\end{minted}
\end{enumerate}

\chapter{Design}
\label{sec:org85ae2ef}
The core of any reverse-mode automatic differentiation is the data
structure to store and visit the callstack. \texttt{Fazang} achieves this
through two derived types, \texttt{tape} and \texttt{vari}.

\section{\texttt{tape} data structure}
\label{sec:org2bb7ef1}
A \texttt{tape} is an \texttt{int32} array emulating a stack, with an integer marker \texttt{head} pointing to the
head to the current stack top.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
type :: tape
     integer(ik) :: head = 1
     integer(ik), allocatable :: storage(:)
!...
\end{minted}
Each time a new AD node is created,
space in \texttt{storage} is allotted to store the node's
\begin{itemize}
\item value \(f_i(z_i)\),
\item adjoint \(z_{i-1}^{\text{adj}}\),
\item number of \texttt{var} operands of \(f_i\),
\item The \texttt{var} operands' index in the same \texttt{tape} array,
\item number of \texttt{real64} operands of \(f_i\),
\item The \texttt{real64} operands' value.
\end{itemize}

Since a node's value, adjoint, and data
operands are \texttt{real64}, they are first converted to \texttt{int32} using
\texttt{transfer} function before stored in the \texttt{tape} array, so that each such
a value occupies two \texttt{storage} entries. After each
allotation, the \texttt{head} is moved to point to the next empty slot in
the array after saving its current value to a \texttt{vari} type variable
for future retrieval.

\section{\texttt{vari} type}
\label{sec:org611a41b}
The \texttt{vari} type is simply a proxy of a node's storage location in the tape
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
type :: vari
  integer(ik) :: i = 0
  procedure(chain_op), pass, pointer :: chain
contains
   !....
\end{minted}
where \texttt{i} is the index to the beginning of a node's storage, and the
\texttt{chain} procedure encodes the node's operation
\(f_i\). \texttt{chain} follows an interface that describes the chain rule
operation
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
abstract interface
   subroutine chain_op(this)
     import :: vari
     class(vari), intent(in) :: this
   end subroutine chain_op
end interface
\end{minted}
An alternative to integer index is to a \texttt{pointer} to the according
enry in the \texttt{tape} array. However, we will need to expand the
\texttt{storage} when it is filled up, and \texttt{Fazang} does this by doubling the
\texttt{storage} size and use \texttt{move\_alloc} to
restore the original values. Since there is no guarantee that \texttt{move\_alloc}
will keep the original memory, a pointer to the original address would
be corrupted.

As a \texttt{Fazang} program steps forward, a series of \texttt{vari} variables are
generated, with their \emph{values} calculated and stored. This is called
a \emph{forward pass}. The generated \texttt{vari} variables in the forward pass are
stored in array \texttt{varis}. Each entry in \texttt{varis} is a dependent
(operation output) of one or more previous entries.

\section{\texttt{var} type}
\label{sec:orgf8b9d4f}
The user-facing \texttt{var} type serves as proxy to \texttt{vari}. Each \texttt{var}
stores the index of a \texttt{vari} in the \texttt{varis} array.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
type :: var
   integer(int32) :: vi
 contains
   procedure :: val
   procedure :: adj
   procedure :: grad
   procedure :: set_chain
end type var
\end{minted}
After the forward pass, when adjoints are desired, we call \texttt{grad} or
\texttt{gradient} procedure. This initiates a \emph{backward pass}, in which  the
\texttt{varis} array is traversed backward
so that each \texttt{vari}'s \texttt{chain} procedure is called to update the
operand adjoints.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
subroutine grad(this)
  class(var), intent(in) :: this
  integer i
  call callstack % varis (this%vi) % init_dependent()
  do i = callstack % head - 1, 1, -1
     call callstack % varis(i) % chain()
  end do
end subroutine grad
\end{minted}
Here \texttt{callstack} is the module variable that encapsulate \texttt{tape} and
\texttt{varis} arrays.
