doc/fazang_user_guide.org
** Nested tape
{{{fz}}} use =begin_nested()= and =end_nested()= to record and
terminate a nested tape. With =call begin_nested()= {{{fz}}} records
the current =tape= and =varis= array head. When =end_nested()= is
called, the storage between the recorded head and current head are
wiped, and the head is moved back to the recorded location. Multiple
levels of nested envionment are supported this way.

* Add operation functions
Adding an operation $f_i$ involves creating functions for forward
pass and backward pass. Let us first use =log= function as a simple
example.

First, we create a =log_v= function for the forward pass.
#+begin_src fortran
  impure elemental function log_v(v) result(s)
    type(var), intent(in) :: v
    type(var) :: s
    s = var(log(v%val()), [v])
    call s%set_chain(chain_log)
  end function log_v
#+end_src
The function generates a new =var= variable =s= using a special
constructor =var(value, array of operands)= which stores the value as
well as the single operand =v='s index (in the =tape= =storage=
array). It also points =s='s chain to a dedicated procedure =chain_log=.
#+begin_src fortran
  subroutine chain_log(this)
    class(vari), intent(in) :: this
    real(rk) :: adj(1), val(1)
    val = this%operand_val()
    adj(1) = this%adj() / val(1)
    call this%set_operand_adj(adj)
  end subroutine chain_log
#+end_src
To understand this function, recall the recursion in Section [[sec:gradient]],
assume the =log= operation is node $i$, then $f_i=\log(\dot)$ and
$z_i$ is the operand =v=, and the new =var= =s= would be
$z_{i-1}$. During the backward pass when the node is visited, =chain_log= 
first retrieves current $(z_i, z_i^{\text{adj}})$
using =operand_val()= and =operand_adj()=, then updates
$z_i^{\text{adj}}$ with an additional
\begin{equation*}
z_{i-1}^{\text{adj}} \frac{df_i}{dz_i} = z_{i-1}^{\text{adj}}\frac{d\log(z_i)}{dz_i}=\frac{z_{i-1}^{\text{adj}}}{z_i}.
\end{equation*}

Adding a binary operation $f_i(z_i^{(1)}, z_i^{2})$ is slightly more complex, as we will need to
address possibly different scenarios when $z_i^{(1)}$ and $z_i^{(2)}$
are either =var= or =real64=. Let us use overloaded division =operator(/)= as an example.

With
\begin{equation*}
f_i(z_i^{(1)}, z_i^{2}) = z_i^{(1)} / z_i^{(2)}
\end{equation*}
we need to account for
- both $z_i^{(1)}$ and $z_i^{2}$ are =var='s
- $z_i^{(1)}$ is =var=, $z_i^{2}$ is =real64=,
- $z_i^{(1)}$ is =real64=, $z_i^{2}$ is =var=,


For the first scenario, we create
#+begin_src fortran
  impure elemental function div_vv(v1, v2) result(s)
    type(var), intent(in) :: v1, v2
    type(var) :: s
    s = var(v1%val() / v2%val(), [v1, v2])
    call s%set_chain(chain_div_vv)
  end function div_vv
#+end_src
Similar to the =log= example, we create a new =s= with both operands
stored. In the corresponding =chain= procedure, we need update
the adjoints of both =v1= and =v2=.
#+begin_src fortran
  subroutine chain_div_vv(this)
    class(vari), intent(in) :: this
    real(rk) :: adj(2), val(2)
    val = this%operand_val()
    adj(1) = this%adj()/val(2)
    adj(2) = - this%val() * this%adj()/val(2)
    call this%set_operand_adj(adj)
  end subroutine chain_div_vv
#+end_src

For the second scenario, we create
#+begin_src fortran
    impure elemental function div_vd(v, d) result(s)
      type(var), intent(in) :: v
      real(rk), intent(in) :: d
      type(var) :: s
      s = var(v%val() / d, [v], [d])
      call s%set_chain(chain_div_vd)
    end function div_vd
#+end_src
Again we create a new =var= =s=. But this time
we use another constructor =var(value, var operands, data
operands)= to store value, =var= operand =v=, and =real64=
operand =d=. In the corresponding backward pass =chain= procedure, not
      only we need retrieve =var= operand =v= but also data operand
      =d=, as the new adjoint of $z_i^{(1)}$ is
\begin{equation*}
z_i^{(1)\text{new adj}} = z_i^{(1)\text{old adj}} + z_{i-1}^{\text{adj}}\frac{df_i}{dz_i^{(1)}}
= z_i^{(1)\text{old adj}} + z_{i-1}^{\text{adj}}\frac{1}{dz_i^{(2)}}
\end{equation*}      
So with =v= as $z_i^{(1)}$ and =d= as $z_i^{(2)}$ we have
#+begin_src fortran
  subroutine chain_div_vd(this)
    class(vari), intent(in) :: this
    real(rk) d(1), adj(1)
    d = this%data_operand()
    adj(1) = this%adj() / d(1)
    call this%set_operand_adj(adj)
  end subroutine chain_div_vd
#+end_src

The third scenario is treated similarly.

#+LaTeX: \appendix
* {{{fz}}} Functions \label{sec:func_list}
  <<appendix:func>>  
| Function        | Argument(s)       | Operation                                     |
|-----------------+-------------------+-----------------------------------------------|
| =sin=           | scalar or array   | same as intrinsic                             |
| =cos=           | scalar or array   | same as intrinsic                             |
| =tan=           | scalar or array   | same as intrinsic                             |
| =asin=          | scalar or array   | same as intrinsic                             |
| =acos=          | scalar or array   | same as intrinsic                             |
| =atan=          | scalar or array   | same as intrinsic                             |
| =log=           | scalar or array   | same as intrinsic                             |
| =exp=           | scalar or array   | same as intrinsic                             |
| =sqrt=          | scalar or array   | same as intrinsic                             |
| =erf=           | scalar or array   | same as intrinsic                             |
| =erfc=          | scalar or array   | same as intrinsic                             |
| =abs=           | scalar or array   | same as intrinsic                             |
| =norm2=         | 1D array          | same as intrinsic                             |
| =hypot=         | scalars or arrays | same as intrinsic                             |
| =sinh=          | scalar of array   | same as intrinsic                             |
| =cosh=          | scalar of array   | same as intrinsic                             |
| =tanh=          | scalar of array   | same as intrinsic                             |
| =asinh=         | scalar of array   | same as intrinsic                             |
| =acosh=         | scalar of array   | same as intrinsic                             |
| =atanh=         | scalar of array   | same as intrinsic                             |
| =log_gamma=     | scalar or array   | same as intrinsic                             |
| =square=        | scalar or array   | For input =x=, calculate =x**2=               |
| =inv=           | scalar or array   | For input =x=, calculate =1/x=                |
| =inv_square=    | scalar or array   | For input =x=, calculate =1/x**2=             |
| =inv_sqrt=      | scalar or array   | For input =x=, calculate =1/sqrt(x)=          |
| =logit=         | scalar or array   | For input =x=, calculate =log(x/(1-x))=       |
| =inv_logit=     | scalar or array   | For input =x=, calculate =1/(1+exp(-x))=      |
| operator (=+=)  | scalars or arrays | same as intrinsic                             |
| operator (=-=)  | scalars or arrays | same as intrinsic                             |
| operator (=*=)  | scalars or arrays | same as intrinsic                             |
| operator (=/=)  | scalars or arrays | same as intrinsic                             |
| operator (=**=) | scalars           | same as intrinsic                             |
| =sum=           | 1D array          | same as intrinsic                             |
| =dot_product=   | 1D arrays         | same as intrinsic                             |
| =log_sum_exp=   | 1D array          | For input =x=, calculate =log(sum(exp((x))))= |
| =matmul=        | 2D arrays         | same as intrinsic                             |
#+TBLFM: $1=sinh

* {{{fz}}} Probability distributions \label{sec:likelihood_list}
  <<appendix:likelihood>>  
