doc/fazang_user_guide.tex

\section{Nested tape}
\label{sec:orgde2db32}
\texttt{Fazang} use \texttt{begin\_nested()} and \texttt{end\_nested()} to record and
terminate a nested tape. With \texttt{call begin\_nested()} \texttt{Fazang} records
the current \texttt{tape} and \texttt{varis} array head. When \texttt{end\_nested()} is
called, the storage between the recorded head and current head are
wiped, and the head is moved back to the recorded location. Multiple
levels of nested envionment are supported this way.

\chapter{Add operation functions}
\label{sec:org0c57838}
Adding an operation \(f_i\) involves creating functions for forward
pass and backward pass. Let us first use \texttt{log} function as a simple
example.

First, we create a \texttt{log\_v} function for the forward pass.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
impure elemental function log_v(v) result(s)
  type(var), intent(in) :: v
  type(var) :: s
  s = var(log(v%val()), [v])
  call s%set_chain(chain_log)
end function log_v
\end{minted}
The function generates a new \texttt{var} variable \texttt{s} using a special
constructor \texttt{var(value, array of operands)} which stores the value as
well as the single operand \texttt{v}'s index (in the \texttt{tape} \texttt{storage}
array). It also points \texttt{s}'s chain to a dedicated procedure \texttt{chain\_log}.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
subroutine chain_log(this)
  class(vari), intent(in) :: this
  real(rk) :: adj(1), val(1)
  val = this%operand_val()
  adj(1) = this%adj() / val(1)
  call this%set_operand_adj(adj)
end subroutine chain_log
\end{minted}
To understand this function, recall the recursion in Section \ref{sec:gradient},
assume the \texttt{log} operation is node \(i\), then \(f_i=\log(\dot)\) and
\(z_i\) is the operand \texttt{v}, and the new \texttt{var} \texttt{s} would be
\(z_{i-1}\). During the backward pass when the node is visited, \texttt{chain\_log} 
first retrieves current \((z_i, z_i^{\text{adj}})\)
using \texttt{operand\_val()} and \texttt{operand\_adj()}, then updates
\(z_i^{\text{adj}}\) with an additional
\begin{equation*}
z_{i-1}^{\text{adj}} \frac{df_i}{dz_i} = z_{i-1}^{\text{adj}}\frac{d\log(z_i)}{dz_i}=\frac{z_{i-1}^{\text{adj}}}{z_i}.
\end{equation*}

Adding a binary operation \(f_i(z_i^{(1)}, z_i^{2})\) is slightly more complex, as we will need to
address possibly different scenarios when \(z_i^{(1)}\) and \(z_i^{(2)}\)
are either \texttt{var} or \texttt{real64}. Let us use overloaded division \texttt{operator(/)} as an example.

With
\begin{equation*}
f_i(z_i^{(1)}, z_i^{2}) = z_i^{(1)} / z_i^{(2)}
\end{equation*}
we need to account for
\begin{itemize}
\item both \(z_i^{(1)}\) and \(z_i^{2}\) are \texttt{var}'s
\item \(z_i^{(1)}\) is \texttt{var}, \(z_i^{2}\) is \texttt{real64},
\item \(z_i^{(1)}\) is \texttt{real64}, \(z_i^{2}\) is \texttt{var},
\end{itemize}


For the first scenario, we create
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
impure elemental function div_vv(v1, v2) result(s)
  type(var), intent(in) :: v1, v2
  type(var) :: s
  s = var(v1%val() / v2%val(), [v1, v2])
  call s%set_chain(chain_div_vv)
end function div_vv
\end{minted}
Similar to the \texttt{log} example, we create a new \texttt{s} with both operands
stored. In the corresponding \texttt{chain} procedure, we need update
the adjoints of both \texttt{v1} and \texttt{v2}.
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
subroutine chain_div_vv(this)
  class(vari), intent(in) :: this
  real(rk) :: adj(2), val(2)
  val = this%operand_val()
  adj(1) = this%adj()/val(2)
  adj(2) = - this%val() * this%adj()/val(2)
  call this%set_operand_adj(adj)
end subroutine chain_div_vv
\end{minted}

For the second scenario, we create
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
impure elemental function div_vd(v, d) result(s)
  type(var), intent(in) :: v
  real(rk), intent(in) :: d
  type(var) :: s
  s = var(v%val() / d, [v], [d])
  call s%set_chain(chain_div_vd)
end function div_vd
\end{minted}
Again we create a new \texttt{var} \texttt{s}. But this time
we use another constructor \texttt{var(value, var operands, data
operands)} to store value, \texttt{var} operand \texttt{v}, and \texttt{real64}
operand \texttt{d}. In the corresponding backward pass \texttt{chain} procedure, not
      only we need retrieve \texttt{var} operand \texttt{v} but also data operand
      \texttt{d}, as the new adjoint of \(z_i^{(1)}\) is
\begin{equation*}
z_i^{(1)\text{new adj}} = z_i^{(1)\text{old adj}} + z_{i-1}^{\text{adj}}\frac{df_i}{dz_i^{(1)}}
= z_i^{(1)\text{old adj}} + z_{i-1}^{\text{adj}}\frac{1}{dz_i^{(2)}}
\end{equation*}      
So with \texttt{v} as \(z_i^{(1)}\) and \texttt{d} as \(z_i^{(2)}\) we have
\begin{minted}[breaklines=true,fontsize=\footnotesize,breakanywhere=true]{fortran}
subroutine chain_div_vd(this)
  class(vari), intent(in) :: this
  real(rk) d(1), adj(1)
  d = this%data_operand()
  adj(1) = this%adj() / d(1)
  call this%set_operand_adj(adj)
end subroutine chain_div_vd
\end{minted}

The third scenario is treated similarly.

\appendix
\chapter{\texttt{Fazang} Functions \label{sec:func_list}}
\label{sec:org3f9b4b7}
\label{appendix:func}  
\begin{center}
\begin{tabular}{lll}
Function & Argument(s) & Operation\\
\hline
\texttt{sin} & scalar or array & same as intrinsic\\
\texttt{cos} & scalar or array & same as intrinsic\\
\texttt{tan} & scalar or array & same as intrinsic\\
\texttt{asin} & scalar or array & same as intrinsic\\
\texttt{acos} & scalar or array & same as intrinsic\\
\texttt{atan} & scalar or array & same as intrinsic\\
\texttt{log} & scalar or array & same as intrinsic\\
\texttt{exp} & scalar or array & same as intrinsic\\
\texttt{sqrt} & scalar or array & same as intrinsic\\
\texttt{erf} & scalar or array & same as intrinsic\\
\texttt{erfc} & scalar or array & same as intrinsic\\
\texttt{abs} & scalar or array & same as intrinsic\\
\texttt{norm2} & 1D array & same as intrinsic\\
\texttt{hypot} & scalars or arrays & same as intrinsic\\
\texttt{sinh} & scalar of array & same as intrinsic\\
\texttt{cosh} & scalar of array & same as intrinsic\\
\texttt{tanh} & scalar of array & same as intrinsic\\
\texttt{asinh} & scalar of array & same as intrinsic\\
\texttt{acosh} & scalar of array & same as intrinsic\\
\texttt{atanh} & scalar of array & same as intrinsic\\
\texttt{log\_gamma} & scalar or array & same as intrinsic\\
\texttt{square} & scalar or array & For input \texttt{x}, calculate \texttt{x**2}\\
\texttt{inv} & scalar or array & For input \texttt{x}, calculate \texttt{1/x}\\
\texttt{inv\_square} & scalar or array & For input \texttt{x}, calculate \texttt{1/x**2}\\
\texttt{inv\_sqrt} & scalar or array & For input \texttt{x}, calculate \texttt{1/sqrt(x)}\\
\texttt{logit} & scalar or array & For input \texttt{x}, calculate \texttt{log(x/(1-x))}\\
\texttt{inv\_logit} & scalar or array & For input \texttt{x}, calculate \texttt{1/(1+exp(-x))}\\
operator (\texttt{+}) & scalars or arrays & same as intrinsic\\
operator (\texttt{-}) & scalars or arrays & same as intrinsic\\
operator (\texttt{*}) & scalars or arrays & same as intrinsic\\
operator (\texttt{/}) & scalars or arrays & same as intrinsic\\
operator (\texttt{**}) & scalars & same as intrinsic\\
\texttt{sum} & 1D array & same as intrinsic\\
\texttt{dot\_product} & 1D arrays & same as intrinsic\\
\texttt{log\_sum\_exp} & 1D array & For input \texttt{x}, calculate \texttt{log(sum(exp((x))))}\\
\texttt{matmul} & 2D arrays & same as intrinsic\\
\end{tabular}
\end{center}

\chapter{\texttt{Fazang} Probability distributions \label{sec:likelihood_list}}
\label{sec:org558cd1e}
\label{appendix:likelihood}  
