doc/fazang_user_guide.org
** Normal distribution
\begin{equation}
\text{Normal}(y, \mu, \sigma) = \prod_{i=1}^n\frac{1}{\sqrt{2\pi}\sigma}\exp{
  \left(
    -\frac{1}{2}
    \left(
      \frac{y_i-\mu}{\sigma}
    \right)^2
  \right)
},\qquad
\forall y\in \mathbb{R}^n, \mu\in \mathbb{R}, \sigma\in \mathbb{R}^+.
\end{equation}

- =normal_lpdf(y, mu, sigma)=
  + =y=: =real64= array.
  + =mu=: =real64= or =var=.
  + =sigma=: =real64= or =var=.
  + Return: the =log= of $\text{Normal}(y, \mu, \sigma)$.

** LogNormal distribution
\begin{equation}
\text{LogNormal}(y, \mu, \sigma) = \prod_{i=1}^n\frac{1}{\sqrt{2\pi}\sigma}\frac{1}{y_i}\exp{
  \left(
    -\frac{1}{2}
    \left(
      \frac{\log{y_i}-\mu}{\sigma}
    \right)^2
  \right)
},\quad
\forall y\in (\mathbb{R}^+)^n, \mu\in \mathbb{R}, \sigma\in \mathbb{R}^+.
\end{equation}

- =lognormal_lpdf(y, mu, sigma)=
  + =y=: =real64= array.
  + =mu=: =real64= or =var=.
  + =sigma=: =real64= or =var=.
  + Return: the =log= of $\text{LogNormal}(y, \mu, \sigma)$.
** TODO additional distributions


bibliographystyle:plain
bibliography:ref.bib
