doc/fazang_user_guide.tex
\section{Normal distribution}
\label{sec:org1a8138a}
\begin{equation}
\text{Normal}(y, \mu, \sigma) = \prod_{i=1}^n\frac{1}{\sqrt{2\pi}\sigma}\exp{
  \left(
    -\frac{1}{2}
    \left(
      \frac{y_i-\mu}{\sigma}
    \right)^2
  \right)
},\qquad
\forall y\in \mathbb{R}^n, \mu\in \mathbb{R}, \sigma\in \mathbb{R}^+.
\end{equation}

\begin{itemize}
\item \texttt{normal\_lpdf(y, mu, sigma)}
\begin{itemize}
\item \texttt{y}: \texttt{real64} array.
\item \texttt{mu}: \texttt{real64} or \texttt{var}.
\item \texttt{sigma}: \texttt{real64} or \texttt{var}.
\item Return: the \texttt{log} of \(\text{Normal}(y, \mu, \sigma)\).
\end{itemize}
\end{itemize}

\section{LogNormal distribution}
\label{sec:org8579ae6}
\begin{equation}
\text{LogNormal}(y, \mu, \sigma) = \prod_{i=1}^n\frac{1}{\sqrt{2\pi}\sigma}\frac{1}{y_i}\exp{
  \left(
    -\frac{1}{2}
    \left(
      \frac{\log{y_i}-\mu}{\sigma}
    \right)^2
  \right)
},\quad
\forall y\in (\mathbb{R}^+)^n, \mu\in \mathbb{R}, \sigma\in \mathbb{R}^+.
\end{equation}

\begin{itemize}
\item \texttt{lognormal\_lpdf(y, mu, sigma)}
\begin{itemize}
\item \texttt{y}: \texttt{real64} array.
\item \texttt{mu}: \texttt{real64} or \texttt{var}.
\item \texttt{sigma}: \texttt{real64} or \texttt{var}.
\item Return: the \texttt{log} of \(\text{LogNormal}(y, \mu, \sigma)\).
\end{itemize}
\end{itemize}
\section{{\bfseries\sffamily TODO} additional distributions}
\label{sec:orgfacca40}


\bibliographystyle{plain}
\bibliography{ref}
\end{document}
